# Taps --------------------------------------------------------------------- {{{

tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# For contacts in Mutt.
tap "keith/formulae"
# For rcm.
tap "thoughtbot/formulae"
# For a better top, ytop.
tap "cjbassi/ytop"
# For gh.
tap "github/gh"
# For Bloop.
tap "scalacenter/bloop"
# For Coursier.
tap "coursier/formulas"

# }}}
# Shells ------------------------------------------------------------------- {{{

brew "bash"
brew "bash-completion"
brew "fish"

# }}}
# Email -------------------------------------------------------------------- {{{

# Lets me look up contacts in macOS Contacts app.
brew "contacts-cli"
# Lets me fetch my email.
# Confusingly `isync` is the project name, but the executable is `mbsync`.
#
# From: http://isync.sourceforge.net
#
#   > While isync is the project name, mbsync is the current executable name;
#   > this change was necessary because of massive changes in the user
#   > interface. An isync executable still exists; it is a compatibility wrapper
#   > around mbsync.
brew "isync"
# Lets me send email.
brew "msmtp"
# Lets me browse & read email.
brew "neomutt"
# For email searching.
brew "notmuch"
# Lets me go to URLs in emails.
brew "urlview"
# Lets me read HTML-only emails from senders who don't respect us cave dwellers
# with plain text email clients.
brew "w3m"

# }}}
# Version Control ---------------------------------------------------------- {{{

brew "git"
brew "gist"
brew "mercurial"
# CLI repository browsing.
brew "tig"

# }}}
# Chat --------------------------------------------------------------------- {{{

# IRC
brew "weechat"

# }}}
# Programming Languages, DBs, & Language Tools ----------------------------- {{{

# Better Scala REPL.
brew "ammonite-repl"
# terminal recording.
brew "asciinema"
# Program language version manager.  Manages all languages.
brew "asdf"
brew "bloop"
brew "coursier"
brew "nginx"
brew "postgresql"
brew "ruby-build"
brew "sbcl"
brew "watchman"

# }}}
# Security ----------------------------------------------------------------- {{{

brew "hopenpgp-tools"
brew "openssl"
# Useful for printing GPG stuff to paper for physical backup.
brew "paperkey"
# For working with GPG stuff.
brew "pinentry-mac"
# For personalizing & working with Yubikeys.
brew "ykman"
brew "ykpers"
brew "yubikey-personalization"

# }}}
# Utilities, Games, etc. --------------------------------------------------- {{{

# General unix tools that it's good to have
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "libxslt"
brew "libyaml"
brew "readline"
brew "rlwrap"
brew "unixodbc"
brew "unzip"
brew "wget"

# Allow me to use `j` to jump around my filesystem.
brew "autojump"
# Better `cat`.
brew "bat"
# For when I need to turn bluetooth back on & my trackpad is bluetooth.
brew "blueutil"
# A better way to navigate directories.
brew "broot"
# Source code tag files.
brew "ctags"
# `ls` but written in Rust with better defaults.
brew "exa"
# Better `find`.
brew "fd"
# Fuzzy-finder.
brew "fzf"
# For when I need to mess with fonts.
brew "fontforge"
# GitHub CLI tool.  As of this writing (20200218) is in beta and thus I still
# need hub (see below).
brew "gh" # Will replace hub.
# Make pretty graphs.
brew "graphviz"
# CLI Jira.
brew "go-jira"
# Alternative to `cat` & `bat`.
brew "highlight"
# Better top.
brew "htop"
# Older GitHub support to git on the command-line.  This essentially wraps git
# and adds on some GitHub-specific nicities.
brew "hub"
# My blog CMS of choice.
brew "hugo"
# Utility for doing stuff – mostly compression – to images.
brew "imagemagick"
# For easy parsing and rendering of JSON.
brew "jq"
# CLI macOS app store.
brew "mas"
# Slide decks in plain-text Markdown rendered in the Terminal. 😍
brew "mdp"
# Gives me `sponge`.
brew "moreutils"
# When I need to SSH.
brew "mosh"
# Media player.
brew "mpv"
# Disk usage analysis tool.  Like DaisyDisk but CLI.
brew "ncdu"
# RSS Reader
brew "newsboat"
# Manages dotfiles.
brew "rcm"
# Best `grep` replacement.
brew "ripgrep"
# Fancy ASCII print out of computer settings.
brew "neofetch"
# Simple & better `man`.
brew "tldr"
# The terminal multiplexer.
brew "tmux"
# Alternative to `rm` that moves things to the trash rather than destroys them
# forever.
brew "trash"
# Display directories as trees.
brew "tree"
# CLI file navigator.
brew "vifm"
# Best text editor ever & it's cousin.
brew "vim"
brew "nvim"
# For easy parsing and rendering of Yaml.
brew "yq"
# Better top – written in Rust, because we have to rewrite everything in Rust or
# Go now.
brew "ytop"

# }}}
# Casks -------------------------------------------------------------------- {{{

cask_args appdir: "/Applications"

cask "adoptopenjdk8" # Strictly for work.
cask "alfred"
cask "blue-sherpa"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "droplr"
cask "fantastical"
cask "firefox"
cask "firefox-developer-edition"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive-file-stream"
cask "google-hangouts"
cask "intellij-idea-ce"
cask "iTerm2"
cask "keybase"
cask "keycastr"
cask "monodraw"
cask "postman"
cask "signal"
cask "slack-beta"
cask "spotify"
cask "twitch"
cask "vlc"
cask "yubico-yubikey-manager"

# }}}
# macOS App Store ---------------------------------------------------------- {{{

mas "1Password 7", id: 1333542190
mas "Cardhop", id: 1290358394
mas "DaisyDisk", id: 411643860
mas "Deliveries", id: 924726344
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Marked 2", id: 890031187
mas "Monit", id: 1014850245
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Soulver", id: 413965349
mas "Speedtest", id: 1153157709
mas "Things", id: 904280696
mas "Xcode", id: 497799835
mas "xScope", id: 889428659

# }}}

# vim: filetype=ruby:textwidth=80:foldmethod=marker
# vim: foldmarker={{{,}}}:foldlevelstart=0
