# Taps -------------------------------------------------------------------- {{{1

tap 'atlassian/homebrew-acli'
tap 'gusto/gusto'

# Shells ------------------------------------------------------------------ {{{1

brew 'fish'

# Git --------------------------------------------------------------------- {{{1

brew 'git'
brew 'git-delta'
brew 'lazygit'

# Programming Languages & Language Tools ---------------------------------- {{{1

brew 'awscli' # No longer needed for Claude, but still needed for AWS.
brew 'libyaml' # Needed for ruby & yaml for some reason.
brew 'luarocks'
brew 'mise'
brew 'postgresql'
brew 'tree-sitter'
brew 'tree-sitter-cli'

# Security ---------------------------------------------------------------- {{{1

brew 'gpg'
brew 'pinentry-mac'

# Utilities --------------------------------------------------------------- {{{1

brew 'atlassian/homebrew-acli/acli'
brew 'bat'
brew 'fastfetch'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'ghostscript' # Required by imagemagick.
brew 'imagemagick'
brew 'jq'
brew 'lazydocker'
brew 'lsd'
brew 'mas'
brew 'neovim'
brew 'ripgrep'
brew 'rsync'
brew 'stow'
brew 'tealdeer'
brew 'tmux'
brew 'tree'
brew 'zoxide'

# Casks ------------------------------------------------------------------- {{{1

cask 'chatgpt'
cask 'claude'
cask 'claude-code@latest' # Gusto's `scope doctor` mandates this variant and actively uninstalls plain `claude-code`.
cask 'google-chrome'
cask 'notion'
cask 'vlc'
cask 'wezterm'

# vim: set filetype=ruby textwidth=80 foldmethod=marker foldlevel=0:
