# Taps -------------------------------------------------------------------- {{{1

# No taps at the moment, but if I need to add any, I'll add them here.

# Shells ------------------------------------------------------------------ {{{1

brew 'fish'

# Git --------------------------------------------------------------------- {{{1

brew 'git'
brew 'git-delta'
brew 'lazygit'

# IRC --------------------------------------------------------------------- {{{1

brew 'weechat'

# Programming Languages & Language Tools ---------------------------------- {{{1

brew 'luarocks'
brew 'mise'
brew 'postgresql'
# Ideally I'd manage `sbcl` with mise, but it's not supported by mise yet so
# I'm using Roswell for now.
brew 'roswell'
brew 'tree-sitter'
brew 'tree-sitter-cli'

# Security ---------------------------------------------------------------- {{{1

brew 'gpg'
brew 'pinentry-mac'

# Utilities --------------------------------------------------------------- {{{1

brew 'zoxide'
brew 'bat'
brew 'fastfetch'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'ghostscript' # Required by imagemagick.
brew 'hugo'
brew 'imagemagick'
brew 'jq'
brew 'lazydocker'
brew 'lsd'
brew 'mas'
brew 'mdp'
brew 'neovim'
brew 'rclone'
brew 'ripgrep'
brew 'rsync'
brew 'stow'
brew 'tealdeer'
brew 'tectonic'
brew 'tmux'
brew 'tree'

# Casks ------------------------------------------------------------------- {{{1

cask 'alfred'
cask 'backblaze'
cask 'chatgpt'
cask 'claude'
cask 'discord'
cask 'docker-desktop'
cask 'droplr'
cask 'google-chrome'
cask 'mattermost'
cask 'plex'
cask 'steam'
cask 'signal'
cask 'vlc'
cask 'wezterm'
cask 'zoom'

# macOS App Store --------------------------------------------------------- {{{1

mas 'DaisyDisk', id: 411_643_860
mas 'Day One', id: 1_055_511_498
mas 'Deliveries', id: 290_986_013
mas 'Drafts', id: 1_435_957_248
mas 'GarageBand', id: 682_658_836
mas 'iMovie', id: 408_981_434
mas 'Ivory', id: 6_444_602_274
mas 'Keynote', id: 409_183_694
mas 'Marked 2', id: 890_031_187
mas 'Numbers', id: 409_203_825
mas 'Pages', id: 409_201_541
mas 'Reeder', id: 1_529_448_980
mas 'VPN Unlimited', id: 694_633_015
mas 'Wireguard', id: 1_451_685_025
mas 'Xcode', id: 497_799_835

# vim: filetype=ruby textwidth=80 foldmethod=marker foldlevel=0
