# Shells ------------------------------------------------------------------ {{{1

brew "bash-completion"
brew "fish"

# Version Control --------------------------------------------------------- {{{1

brew "gist"
brew "git"
brew "git-delta"
brew "lazygit"

# Chat -------------------------------------------------------------------- {{{1

brew "weechat"

# Programming Languages, DBs, & Language Tools ---------------------------- {{{1

brew "luarocks"
brew "node"

# Security ---------------------------------------------------------------- {{{1

brew "gpg"
brew "pinentry-mac"

# Utilities, Games, etc. -------------------------------------------------- {{{1

brew "autojump"
brew "bat"
brew "fd"
brew "fzf"
brew "gh"
brew "ghostscript" # Required by imagemagick.
brew "hugo"
brew "imagemagick"
brew "jq"
brew "lsd"
brew "mas"
brew "mdp"
brew "neofetch"
brew "neovim"
brew "ripgrep"
brew "stow"
brew "tectonic"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "wget"

# Casks ------------------------------------------------------------------- {{{1

cask "alfred"
cask "backblaze"
cask "discord"
cask "docker-desktop"
cask "droplr"
cask "mattermost"
cask "plex"
cask "steam"
cask "vlc"
cask "wezterm"
cask "zoom"

# macOS App Store --------------------------------------------------------- {{{1

mas "DaisyDisk", id: 411643860
mas "Deliveries", id: 290986013
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "Marked 2", id: 890031187
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 1529448980
mas "Xcode", id: 497799835

# vim: filetype=ruby textwidth=80 foldmethod=marker foldlevel=0
